#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=strangely-steady-monkfish]
random_password.master: Refreshing state... [id=none]
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.memory.data.aws_ecr_image.lambda_image: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
aws_api_gateway_api_key.this: Refreshing state... [id=o3ir7y5ntl]
aws_api_gateway_deployment.this (deposed object adeca273): Refreshing state... [id=6nc7dh]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 1s [id=aws]
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 1s [id=us-east-1]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 1s [id=us-east-1]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 1s [id=2690255455]
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion-dev]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage-dev]
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev_dead_letter]
module.list_collections.module.api_gateway.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00fb300ee2d2f7b3b]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
data.aws_availability_zones.available: Reading...
module.list_collections.module.api_gateway.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.list_collections.data.aws_ecr_image.lambda_image: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
aws_api_gateway_rest_api.this: Refreshing state... [id=d09uj3e9kh]
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory-dev]
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference-dev]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.inference.data.aws_ecr_image.lambda_image: Reading...
data.aws_ami.latest_amazon_linux: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history-dev]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.list_collections.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-list-collections-dev]
module.memory.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:ebb19f58bf598d39111b1c1303c772352dd77c8d06b3a7f7acb4bb75ea3f3a05]
module.inference.module.api_gateway.data.aws_caller_identity.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
module.inference.module.api_gateway.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.data.aws_ecr_image.lambda_image: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3277652423]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.list_collections.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:05312ba7d8b8c87302283393ed2975ebfb8e403e8014c225bb050115eee4bf14]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1348983281]
module.inference.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:dd207cd75a0c54d5f6cf9a7efa61d1f86b8bd2454cad71ee9fff3dcbb0adfe2e]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lex_router.data.aws_ecr_image.lambda_image: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
data.aws_ami.latest_amazon_linux: Read complete after 0s [id=ami-03c951bbe993ea087]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lex_router.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-lex-router-dev]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role]
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.list_collections.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role]
module.lex_router.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:9f2ecc7e02c2390e8f7ea8ac4aa202a0db1da744c7bb230bbb6687cf063db6f2]
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|terraform-20240126151709956800000002]
module.ingestion.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:1719bf10673279a61f5b69af2096cdec404d1ff15456283e0ddf59ebfc325629]
data.aws_secretsmanager_secret.password: Reading...
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-inline]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-inline]
module.lex_router.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b9066ddfe118437e]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7ddd92ffe7cad50]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-086b3e733d88fa370]
data.aws_secretsmanager_secret_version.password: Reading...
module.inference.module.api_gateway.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=c30cce]
module.list_collections.module.api_gateway.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=i033qb]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=52771042]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3522429600]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2926739739]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-0902cb6d437a968b6]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0b9900b5db426c576]
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|AWSCURRENT]
aws_security_group.lambda_egress_all_sg: Refreshing state... [id=sg-054f9a76901acf353]
aws_security_group.sm_sg: Refreshing state... [id=sg-013ee0bdd16b8366f]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=736838273]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1366123725]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710029800000004]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3953744684]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-logs]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-logs]
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-logs]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512646400000001]
module.list_collections.module.api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-i033qb-GET]
module.inference.module.api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-c30cce-GET]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-logs]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03f5acb4bc8b5d586]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0d1f5f95132e695a6]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04aae6346ab85dfe5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbe5e0845bba1093]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09be498e3f465bbb5]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02f9981846a152b24]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-logs]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-i033qb-OPTIONS]
module.inference.module.api_gateway.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-c30cce-OPTIONS]
module.list_collections.module.api_gateway.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-list-collections-dev]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0f03a46a772c6a571]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-00ef44a2d775aaa99]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710095500000006]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-20240126151710031000000005]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-20240126151710029200000003]
module.inference.module.api_gateway.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev]
aws_security_group.database_sg: Refreshing state... [id=sg-02511ace313a817bd]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-0c6d3637458aa4799]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240130201651725000000001]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-i033qb-OPTIONS]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-i033qb-OPTIONS-200]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform-dev]
module.inference.module.api_gateway.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-c30cce-OPTIONS]
module.inference.module.api_gateway.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-c30cce-OPTIONS-200]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-066d9aa6005ec7c94]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db0a8005c04ca4f2]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02f9981846a152b241080289494]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512785600000002]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0d7135c7f623e06f8]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-044bfd1713e1c30ec]
aws_vpc_endpoint.lambda_endpoint: Refreshing state... [id=vpce-0b1660c4cfd3c329e]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-07b8182fd57a40bc7]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0a8ed6effde8d7daf]
aws_instance.jumpbox: Refreshing state... [id=i-0cd5eadbd064719b1]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-i033qb-OPTIONS-200]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0fdf03f021658d47f]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-04b83095daf470dae]
module.inference.module.api_gateway.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-c30cce-OPTIONS-200]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory-dev]
module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev]
aws_db_instance.vector_db: Refreshing state... [id=db-KTG3TDKXH3C3BOXFTTIFJ5SASY]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1333636943]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2560015702]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-inline]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=242001761]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-inline]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-inline]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240202005532784400000004]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-2024012615222186470000000d]
module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-2024012615222187350000000e]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference-dev]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=ffdd3b10-6ac6-4fbf-bbd1-a7e6e82bf9d1]
module.list_collections.module.api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-i033qb-GET]
module.inference.module.api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-c30cce-GET]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage-dev]
aws_api_gateway_deployment.this: Refreshing state... [id=5kqc15]
aws_api_gateway_stage.this: Refreshing state... [id=ags-d09uj3e9kh-dev]
aws_api_gateway_usage_plan.this: Refreshing state... [id=jxe0z0]
aws_api_gateway_usage_plan_key.this: Refreshing state... [id=o3ir7y5ntl]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_api_key.this is tainted, so must be replaced
-/+ resource "aws_api_gateway_api_key" "this" {
      ~ arn               = "arn:aws:apigateway:us-east-1::/apikeys/o3ir7y5ntl" -> (known after apply)
      ~ created_date      = "2024-02-12T14:54:27Z" -> (known after apply)
      ~ id                = "o3ir7y5ntl" -> (known after apply)
      ~ last_updated_date = "2024-02-12T16:21:01Z" -> (known after apply)
        name              = "levio-demo-fev-api-key"
      - tags              = {} -> null
      ~ value             = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2024-02-12T16:21:31Z" -> (known after apply)
      ~ description   = "Deployment for 2024-02-12T16:21:31Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> (known after apply)
      ~ id            = "5kqc15" -> (known after apply)
      ~ invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "2024-02-12T16:21:31Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_deployment.this (deposed object adeca273) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "this" {
      - created_date  = "2024-02-12T14:54:58Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> null
      - id            = "6nc7dh" -> null
      - invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> null
      - rest_api_id   = "d09uj3e9kh" -> null
    }

  # aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "5kqc15" -> (known after apply)
        id                    = "ags-d09uj3e9kh-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_api_gateway_usage_plan.this will be updated in-place
  ~ resource "aws_api_gateway_usage_plan" "this" {
        id       = "jxe0z0"
        name     = "api_gateway_usage_plan"
        tags     = {}
        # (2 unchanged attributes hidden)

      - api_stages {
          - api_id = "d09uj3e9kh" -> null
          - stage  = "dev" -> null
        }
      + api_stages {
          + api_id = "d09uj3e9kh"
          + stage  = "dev"

          + throttle {
              + burst_limit = 50
              + path        = "/inference/GET"
              + rate_limit  = 0
            }
        }

      ~ quota_settings {
          ~ offset = 2 -> 0
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_usage_plan_key.this must be replaced
-/+ resource "aws_api_gateway_usage_plan_key" "this" {
      ~ id            = "o3ir7y5ntl" -> (known after apply)
      ~ key_id        = "o3ir7y5ntl" # forces replacement -> (known after apply) # forces replacement
      ~ name          = "levio-demo-fev-api-key" -> (known after apply)
      ~ value         = "g6SeSHxBsgldDetu40IA4B9jesZMmw8lNO1c8Dh0" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:fbb1374630baad4e8de9e8b678a44eedfe373df113389f45ac5bfccc28790404" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:dd207cd75a0c54d5f6cf9a7efa61d1f86b8bd2454cad71ee9fff3dcbb0adfe2e"
      ~ last_modified                  = "2024-02-12T16:21:02.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-ingestion-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:36d950f978649342ea72f50906755c89a876b5da16a0ce37be3aef5fb1525ebd" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:1719bf10673279a61f5b69af2096cdec404d1ff15456283e0ddf59ebfc325629"
      ~ last_modified                  = "2024-02-12T16:21:01.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-lex-router-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:76d40093d7d0c2cbb4f78f1cead19c502eca6ed1a12dba4c581e921fa4ca51e7" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:9f2ecc7e02c2390e8f7ea8ac4aa202a0db1da744c7bb230bbb6687cf063db6f2"
      ~ last_modified                  = "2024-02-12T16:21:01.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-list-collections-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:bcfbfdbb7de0ab7927aa044f1bd2586cbfec1fc3e51389290dc533362337976a" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:05312ba7d8b8c87302283393ed2975ebfb8e403e8014c225bb050115eee4bf14"
      ~ last_modified                  = "2024-02-12T16:21:01.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.memory.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-memory-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:623df2660fb4c3ad15f2befed029fb45fd797c17020779b35deacb9ebdb33aed" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:ebb19f58bf598d39111b1c1303c772352dd77c8d06b3a7f7acb4bb75ea3f3a05"
      ~ last_modified                  = "2024-02-12T16:21:01.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 3 to add, 7 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.tfplan"

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Deploy Lambdas & Terraform Plan on PR`*